{
    "i2v": {
        "0": "",
        "1": "!",
        "2": "\"",
        "3": "&",
        "4": "'",
        "5": "(",
        "6": ")",
        "7": ",",
        "8": "-",
        "9": ".",
        "10": "/",
        "11": "0",
        "12": "1",
        "13": "2",
        "14": "3",
        "15": "4",
        "16": "5",
        "17": "6",
        "18": "7",
        "19": "8",
        "20": "9",
        "21": ":",
        "22": ";",
        "23": "?",
        "24": "A",
        "25": "B",
        "26": "C",
        "27": "D",
        "28": "E",
        "29": "G",
        "30": "H",
        "31": "I",
        "32": "J",
        "33": "K",
        "34": "N",
        "35": "O",
        "36": "P",
        "37": "R",
        "38": "S",
        "39": "T",
        "40": "U",
        "41": "V",
        "42": "Y",
        "43": "[",
        "44": "_",
        "45": "a",
        "46": "b",
        "47": "d",
        "48": "e",
        "49": "i",
        "50": "l",
        "51": "n",
        "52": "o",
        "53": "p",
        "54": "q",
        "55": "r",
        "56": "s",
        "57": "t",
        "58": "u",
        "59": "v",
        "60": "w",
        "61": "y",
        "62": "|",
        "63": "ँ",
        "64": "ं",
        "65": "ः",
        "66": "अ",
        "67": "आ",
        "68": "इ",
        "69": "ई",
        "70": "उ",
        "71": "ऊ",
        "72": "ऋ",
        "73": "ए",
        "74": "ऐ",
        "75": "ऑ",
        "76": "ओ",
        "77": "औ",
        "78": "क",
        "79": "ख",
        "80": "ग",
        "81": "घ",
        "82": "ङ",
        "83": "च",
        "84": "छ",
        "85": "ज",
        "86": "झ",
        "87": "ञ",
        "88": "ट",
        "89": "ठ",
        "90": "ड",
        "91": "ढ",
        "92": "ण",
        "93": "त",
        "94": "थ",
        "95": "द",
        "96": "ध",
        "97": "न",
        "98": "प",
        "99": "फ",
        "100": "ब",
        "101": "भ",
        "102": "म",
        "103": "य",
        "104": "र",
        "105": "ऱ",
        "106": "ल",
        "107": "ळ",
        "108": "व",
        "109": "श",
        "110": "ष",
        "111": "स",
        "112": "ह",
        "113": "़",
        "114": "ऽ",
        "115": "ा",
        "116": "ि",
        "117": "ी",
        "118": "ु",
        "119": "ू",
        "120": "ृ",
        "121": "े",
        "122": "ै",
        "123": "ॉ",
        "124": "ो",
        "125": "ौ",
        "126": "्",
        "127": "क़",
        "128": "ख़",
        "129": "ग़",
        "130": "ज़",
        "131": "ड़",
        "132": "ढ़",
        "133": "फ़",
        "134": "य़",
        "135": "ॠ",
        "136": "।",
        "137": "०",
        "138": "१",
        "139": "२",
        "140": "३",
        "141": "४",
        "142": "५",
        "143": "६",
        "144": "७",
        "145": "८",
        "146": "९",
        "147": "‌",
        "148": "–",
        "149": "—",
        "150": "‘",
        "151": "’",
        "152": "“",
        "153": "”",
        "154": "…",
        "155": "c",
        "156": "h",
        "157": "॥",
        "158": "f",
        "159": "g",
        "160": "॰",
        "161": "k",
        "162": "=",
        "163": "m",
        "164": "*",
        "165": "M",
        "166": "x",
        "167": "]",
        "168": "ऍ",
        "169": "ॅ",
        "170": "L",
        "171": "+",
        "172": "X",
        "173": "ॄ",
        "174": "ॐ",
        "175": "W",
        "176": "j",
        "177": "F",
        "178": "z",
        "179": "Q",
        "180": "﻿",
        "181": "•",
        "182": "ॆ",
        "183": "Z",
        "184": "@",
        "185": "ऎ",
        "186": "ॊ",
        "187": "%",
        "188": " ",
        "189": "\t",
        "190": "<",
        "191": ">",
        "192": "\\",
        "193": "`",
        "194": "#",
        "195": "॒",
        "196": "॑"
    },
    "v2i": {
        "": 0,
        "\t": 189,
        " ": 188,
        "!": 1,
        "\"": 2,
        "#": 194,
        "%": 187,
        "&": 3,
        "'": 4,
        "(": 5,
        ")": 6,
        "*": 164,
        "+": 171,
        ",": 7,
        "-": 8,
        ".": 9,
        "/": 10,
        "0": 11,
        "1": 12,
        "2": 13,
        "3": 14,
        "4": 15,
        "5": 16,
        "6": 17,
        "7": 18,
        "8": 19,
        "9": 20,
        ":": 21,
        ";": 22,
        "<": 190,
        "=": 162,
        ">": 191,
        "?": 23,
        "@": 184,
        "A": 24,
        "B": 25,
        "C": 26,
        "D": 27,
        "E": 28,
        "F": 177,
        "G": 29,
        "H": 30,
        "I": 31,
        "J": 32,
        "K": 33,
        "L": 170,
        "M": 165,
        "N": 34,
        "O": 35,
        "P": 36,
        "Q": 179,
        "R": 37,
        "S": 38,
        "T": 39,
        "U": 40,
        "V": 41,
        "W": 175,
        "X": 172,
        "Y": 42,
        "Z": 183,
        "[": 43,
        "\\": 192,
        "]": 167,
        "_": 44,
        "`": 193,
        "a": 45,
        "b": 46,
        "c": 155,
        "d": 47,
        "e": 48,
        "f": 158,
        "g": 159,
        "h": 156,
        "i": 49,
        "j": 176,
        "k": 161,
        "l": 50,
        "m": 163,
        "n": 51,
        "o": 52,
        "p": 53,
        "q": 54,
        "r": 55,
        "s": 56,
        "t": 57,
        "u": 58,
        "v": 59,
        "w": 60,
        "x": 166,
        "y": 61,
        "z": 178,
        "|": 62,
        "ँ": 63,
        "ं": 64,
        "ः": 65,
        "अ": 66,
        "आ": 67,
        "इ": 68,
        "ई": 69,
        "उ": 70,
        "ऊ": 71,
        "ऋ": 72,
        "ऍ": 168,
        "ऎ": 185,
        "ए": 73,
        "ऐ": 74,
        "ऑ": 75,
        "ओ": 76,
        "औ": 77,
        "क": 78,
        "ख": 79,
        "ग": 80,
        "घ": 81,
        "ङ": 82,
        "च": 83,
        "छ": 84,
        "ज": 85,
        "झ": 86,
        "ञ": 87,
        "ट": 88,
        "ठ": 89,
        "ड": 90,
        "ढ": 91,
        "ण": 92,
        "त": 93,
        "थ": 94,
        "द": 95,
        "ध": 96,
        "न": 97,
        "प": 98,
        "फ": 99,
        "ब": 100,
        "भ": 101,
        "म": 102,
        "य": 103,
        "र": 104,
        "ऱ": 105,
        "ल": 106,
        "ळ": 107,
        "व": 108,
        "श": 109,
        "ष": 110,
        "स": 111,
        "ह": 112,
        "़": 113,
        "ऽ": 114,
        "ा": 115,
        "ि": 116,
        "ी": 117,
        "ु": 118,
        "ू": 119,
        "ृ": 120,
        "ॄ": 173,
        "ॅ": 169,
        "ॆ": 182,
        "े": 121,
        "ै": 122,
        "ॉ": 123,
        "ॊ": 186,
        "ो": 124,
        "ौ": 125,
        "्": 126,
        "ॐ": 174,
        "॑": 196,
        "॒": 195,
        "क़": 127,
        "ख़": 128,
        "ग़": 129,
        "ज़": 130,
        "ड़": 131,
        "ढ़": 132,
        "फ़": 133,
        "य़": 134,
        "ॠ": 135,
        "।": 136,
        "॥": 157,
        "०": 137,
        "१": 138,
        "२": 139,
        "३": 140,
        "४": 141,
        "५": 142,
        "६": 143,
        "७": 144,
        "८": 145,
        "९": 146,
        "॰": 160,
        "‌": 147,
        "–": 148,
        "—": 149,
        "‘": 150,
        "’": 151,
        "“": 152,
        "”": 153,
        "•": 181,
        "…": 154,
        "﻿": 180
    }
}