{
    "i2v": {
        "0": "",
        "1": "్",
        "2": "ౌ",
        "3": "ో",
        "4": "ొ",
        "5": "ై",
        "6": "ే",
        "7": "ె",
        "8": "ౄ",
        "9": "ృ",
        "10": "ూ",
        "11": "ు",
        "12": "ీ",
        "13": "ి",
        "14": "ా",
        "15": "హ",
        "16": "స",
        "17": "ష",
        "18": "శ",
        "19": "వ",
        "20": "ళ",
        "21": "ల",
        "22": "ఱ",
        "23": "ర",
        "24": "య",
        "25": "మ",
        "26": "భ",
        "27": "బ",
        "28": "ఫ",
        "29": "ప",
        "30": "న",
        "31": "ధ",
        "32": "ద",
        "33": "థ",
        "34": "త",
        "35": "ణ",
        "36": "ఢ",
        "37": "డ",
        "38": "ఠ",
        "39": "ట",
        "40": "ఞ",
        "41": "ఝ",
        "42": "జ",
        "43": "ఛ",
        "44": "చ",
        "45": "ఙ",
        "46": "ఘ",
        "47": "గ",
        "48": "ఖ",
        "49": "క",
        "50": "ఔ",
        "51": "ఓ",
        "52": "ఒ",
        "53": "ఐ",
        "54": "ఏ",
        "55": "ఎ",
        "56": "ఋ",
        "57": "ఊ",
        "58": "ఉ",
        "59": "ఈ",
        "60": "ఇ",
        "61": "ఆ",
        "62": "అ",
        "63": "ః",
        "64": "ం",
        "65": "ఁ",
        "66": "~",
        "67": "}",
        "68": "|",
        "69": "{",
        "70": "y",
        "71": "x",
        "72": "w",
        "73": "v",
        "74": "u",
        "75": "t",
        "76": "s",
        "77": "r",
        "78": "p",
        "79": "o",
        "80": "n",
        "81": "m",
        "82": "l",
        "83": "k",
        "84": "j",
        "85": "i",
        "86": "h",
        "87": "g",
        "88": "f",
        "89": "e",
        "90": "d",
        "91": "c",
        "92": "b",
        "93": "a",
        "94": "`",
        "95": "_",
        "96": "]",
        "97": "[",
        "98": "Y",
        "99": "X",
        "100": "W",
        "101": "V",
        "102": "U",
        "103": "T",
        "104": "S",
        "105": "R",
        "106": "Q",
        "107": "P",
        "108": "O",
        "109": "N",
        "110": "M",
        "111": "L",
        "112": "K",
        "113": "J",
        "114": "I",
        "115": "H",
        "116": "G",
        "117": "F",
        "118": "E",
        "119": "D",
        "120": "C",
        "121": "B",
        "122": "A",
        "123": "@",
        "124": "?",
        "125": ">",
        "126": "=",
        "127": ";",
        "128": ":",
        "129": "9",
        "130": "8",
        "131": "7",
        "132": "6",
        "133": "5",
        "134": "4",
        "135": "3",
        "136": "2",
        "137": "1",
        "138": "0",
        "139": "/",
        "140": ".",
        "141": "-",
        "142": ",",
        "143": "+",
        "144": "*",
        "145": ")",
        "146": "(",
        "147": "'",
        "148": "&",
        "149": "\"",
        "150": "!",
        "151": "౨",
        "152": "౬",
        "153": "౧",
        "154": "౩",
        "155": "౪",
        "156": "౦",
        "157": "౯",
        "158": "౮",
        "159": "౭",
        "160": "౫",
        "161": "‌",
        "162": "ౠ",
        "163": "q",
        "164": "౽",
        "165": "\\",
        "166": "ౖ",
        "167": "%",
        "168": "Z",
        "169": "\t",
        "170": "<",
        "171": "z",
        "172": "﻿",
        "173": " "
    },
    "v2i": {
        "": 0,
        "\t": 169,
        " ": 173,
        "!": 150,
        "\"": 149,
        "%": 167,
        "&": 148,
        "'": 147,
        "(": 146,
        ")": 145,
        "*": 144,
        "+": 143,
        ",": 142,
        "-": 141,
        ".": 140,
        "/": 139,
        "0": 138,
        "1": 137,
        "2": 136,
        "3": 135,
        "4": 134,
        "5": 133,
        "6": 132,
        "7": 131,
        "8": 130,
        "9": 129,
        ":": 128,
        ";": 127,
        "<": 170,
        "=": 126,
        ">": 125,
        "?": 124,
        "@": 123,
        "A": 122,
        "B": 121,
        "C": 120,
        "D": 119,
        "E": 118,
        "F": 117,
        "G": 116,
        "H": 115,
        "I": 114,
        "J": 113,
        "K": 112,
        "L": 111,
        "M": 110,
        "N": 109,
        "O": 108,
        "P": 107,
        "Q": 106,
        "R": 105,
        "S": 104,
        "T": 103,
        "U": 102,
        "V": 101,
        "W": 100,
        "X": 99,
        "Y": 98,
        "Z": 168,
        "[": 97,
        "\\": 165,
        "]": 96,
        "_": 95,
        "`": 94,
        "a": 93,
        "b": 92,
        "c": 91,
        "d": 90,
        "e": 89,
        "f": 88,
        "g": 87,
        "h": 86,
        "i": 85,
        "j": 84,
        "k": 83,
        "l": 82,
        "m": 81,
        "n": 80,
        "o": 79,
        "p": 78,
        "q": 163,
        "r": 77,
        "s": 76,
        "t": 75,
        "u": 74,
        "v": 73,
        "w": 72,
        "x": 71,
        "y": 70,
        "z": 171,
        "{": 69,
        "|": 68,
        "}": 67,
        "~": 66,
        "ఁ": 65,
        "ం": 64,
        "ః": 63,
        "అ": 62,
        "ఆ": 61,
        "ఇ": 60,
        "ఈ": 59,
        "ఉ": 58,
        "ఊ": 57,
        "ఋ": 56,
        "ఎ": 55,
        "ఏ": 54,
        "ఐ": 53,
        "ఒ": 52,
        "ఓ": 51,
        "ఔ": 50,
        "క": 49,
        "ఖ": 48,
        "గ": 47,
        "ఘ": 46,
        "ఙ": 45,
        "చ": 44,
        "ఛ": 43,
        "జ": 42,
        "ఝ": 41,
        "ఞ": 40,
        "ట": 39,
        "ఠ": 38,
        "డ": 37,
        "ఢ": 36,
        "ణ": 35,
        "త": 34,
        "థ": 33,
        "ద": 32,
        "ధ": 31,
        "న": 30,
        "ప": 29,
        "ఫ": 28,
        "బ": 27,
        "భ": 26,
        "మ": 25,
        "య": 24,
        "ర": 23,
        "ఱ": 22,
        "ల": 21,
        "ళ": 20,
        "వ": 19,
        "శ": 18,
        "ష": 17,
        "స": 16,
        "హ": 15,
        "ా": 14,
        "ి": 13,
        "ీ": 12,
        "ు": 11,
        "ూ": 10,
        "ృ": 9,
        "ౄ": 8,
        "ె": 7,
        "ే": 6,
        "ై": 5,
        "ొ": 4,
        "ో": 3,
        "ౌ": 2,
        "్": 1,
        "ౖ": 166,
        "ౠ": 162,
        "౦": 156,
        "౧": 153,
        "౨": 151,
        "౩": 154,
        "౪": 155,
        "౫": 160,
        "౬": 152,
        "౭": 159,
        "౮": 158,
        "౯": 157,
        "౽": 164,
        "‌": 161,
        "﻿": 172
    }
}